---
kind: type
id: T:Autodesk.Revit.Attributes.JournalingAttribute
source: html/15d27441-bc90-b07d-22a3-d6b3e07a1fef.htm
---
# Autodesk.Revit.Attributes.JournalingAttribute

The custom journaling attribute to control the journaling behavior of the external command.

## Syntax (C#)
```csharp
public class JournalingAttribute : Attribute
```